In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

### Q5

In [6]:
gdp_df = pd.read_csv('C:/Users/ben/Documents/Data_Analytics/projects/Python/gdp-and-internet-usage-bensdata/data/gdp_percapita.csv')
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

### Q6

In [7]:
internet_df = pd.read_csv('C:/Users/ben/Documents/Data_Analytics/projects/Python/gdp-and-internet-usage-bensdata/data/internet_use.csv', nrows=4496)
#limited rows to 4496 with nrow=
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

### Q7: Look at the shape of each dataframe - how many rows, how many columns.

In [8]:
gdp_df.shape

(6731, 4)

In [9]:
internet_df.shape

(4496, 4)

### Q8. Take a look at the data types for the columns in each table.

In [10]:
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [11]:
internet_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

Personal Question: Why do the following differ?

In [12]:
internet_df.Value.dtypes

dtype('float64')

In [13]:
type(internet_df.Value)

pandas.core.series.Series

#### Q9 take a look at the last 10 rows of each dataset in turn.

In [15]:
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6721,Zimbabwe,1997,3036.422224,NaN
6722,Zimbabwe,1996,2985.856605,NaN
6723,Zimbabwe,1995,2736.486436,NaN
6724,Zimbabwe,1994,2768.309953,NaN
6725,Zimbabwe,1993,2572.870395,NaN
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [19]:
internet_df.tail(10)

     Country or Area      Year     Value  Value Footnotes
4486        Zimbabwe      2001  0.799846              NaN
4487        Zimbabwe      2000  0.401434              NaN
4488        Zimbabwe      1999  0.161676              NaN
4489        Zimbabwe      1998  0.081648              NaN
4490        Zimbabwe      1997  0.033080              NaN
4491        Zimbabwe      1996  0.016790              NaN
4492        Zimbabwe      1995  0.007684              NaN
4493        Zimbabwe      1994  0.001739              NaN
4494        Zimbabwe      1990  0.000000              NaN
4495   footnoteSeqID  Footnote       NaN              NaN

#### Q10: Drop the 'value footnotes' data (column) from both datasets. Check that this worked as expected.

In [20]:
gdp_df.drop(columns = ['Value Footnotes'])

     Country or Area                                      Year        Value
0        Afghanistan                                      2018  1734.723214
1        Afghanistan                                      2017  1758.465636
2        Afghanistan                                      2016  1757.023490
3        Afghanistan                                      2015  1766.593077
4        Afghanistan                                      2014  1795.735834
...              ...                                       ...          ...
6726        Zimbabwe                                      1992  2591.007534
6727        Zimbabwe                                      1991  2906.272849
6728        Zimbabwe                                      1990  2819.549467
6729   footnoteSeqID                                  Footnote          NaN
6730               2  Excludes South Sudan after July 9, 2011.          NaN

[6731 rows x 3 columns]

In [21]:
internet_df.drop(columns = ['Value Footnotes'])

     Country or Area      Year     Value
0        Afghanistan      2014  6.390000
1        Afghanistan      2013  5.900000
2        Afghanistan      2012  5.454545
3        Afghanistan      2011  5.000000
4        Afghanistan      2010  4.000000
...              ...       ...       ...
4491        Zimbabwe      1996  0.016790
4492        Zimbabwe      1995  0.007684
4493        Zimbabwe      1994  0.001739
4494        Zimbabwe      1990  0.000000
4495   footnoteSeqID  Footnote       NaN

[4496 rows x 3 columns]